       IDENTIFICATION DIVISION.
           PROGRAM-ID. HELLO-WORLD.
      *> comments, as desired
       PROCEDURE DIVISION.
           DISPLAY "Hello World!".
           STOP RUN.
